Autodesk.Navisworks.Api.ProgressEventArgs
Base class for progress related events where event handler can replace standard implementation

Autodesk.Navisworks.Api.ProgressEventArgs.Handled
Sets a value that indicates whether the event handler has completely handled
the event or whether the system should continue its own processing.